---
kind: method
id: M:Autodesk.Revit.DB.RenderingSettings.SetRenderingQualitySettings(Autodesk.Revit.DB.RenderingQualitySettings)
source: html/cdc7c4f1-cbd1-f72b-bb9a-af6d1038cdaa.htm
---
# Autodesk.Revit.DB.RenderingSettings.SetRenderingQualitySettings Method

Change rendering quality settings.

## Syntax (C#)
```csharp
public void SetRenderingQualitySettings(
	RenderingQualitySettings settings
)
```

## Parameters
- **settings** (`Autodesk.Revit.DB.RenderingQualitySettings`) - An instance of the new rendering quality settings.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null